Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: གདུགས་དང་རྒྱལ་མཚན་བ་དན་མཆོག་གིས་མཆོད་པར་འགྱུར། །
en: And they revered him with supreme parasols, victory banners, and flags.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་ཞི་བསྟན་པ་བདེ་བར་གཤེགས། །རྐང་གཉིས་མཆོག་གིས་ཆོས་ཀུན་གཟིགས་པས་དེ་ལུང་བསྟན། །
en: “Thus-Gone One Peaceful Conduct, the Teacher and Blissful One, The foremost of humans who sees everything, then replied,

source: ཤེས་རབ་ཀྱིས་བསལ་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་སྤང་། །
en: ‘Clearing away with insight, abandon desire, anger, and ignorance.

source: ཤེས་པས་ཕུང་པོ་ཤེས་བྱ་སེམས་ཅན་མེད་ཤེས་ཀྱིས། །
en: Understand that there are no aggregates to know and no sentient beings.

source: ཆགས་པ་མར་མེ་ཟད་འདྲ་ཆགས་མེད་ཉེ་བར་ཞི། །
en: “ ‘Then, like a candle going out, attachment is pacified into non-attachment.

source: ལྷ་མི་དྲི་ཟ་དེ་དག་འགྲོ་བ་མི་ཤེས་ཏེ། །
en: Beings like gods, humans, and gandharvas do not understand.

source: ལས་དང་ཉོན་མོངས་ཤེས་ཤིང་སྲིད་ཤེས་མྱ་ངན་མེད། །
en: Understanding karma, afflictions, and existence, there is no suffering.

source: མེ་ཤིང་ཟད་པ་ལྟ་བུར་ཆགས་མེད་མྱ་ངན་འདའ། །
en: Like firewood burned away, you attain nirvāṇa, unattached.

source: གང་ཚེ་སྲེད་དང་བྲལ་གྱུར་རྣམ་ཤེས་རྒྱུད་བསྲེགས་ཤིང་། །
en: “ ‘When you are free of craving, the stream of consciousness is burnt away.

source: སྡུག་བསྔལ་མྱུ་གུ་མི་སྒྲུབ་ཡེ་ཤེས་མེ་ཡིས་བསྲོས། །
en: The sprout of suffering does not form, and you are warmed by flames of wisdom.

source: དེ་ཡི་འགྲོ་བ་མེད་དེ་མེ་ལྕེ་འབར་བ་བཞིན། །
en: In that there is no migration, just as with blazing flames—

source: སངས་རྒྱས་ཀུན་གྱིས་འདུ་བྱེད་འགྲོ་བ་མེད་པར་བསྟན། །
en: So all buddhas teach that there is no migration of the formations.’

source: དེ་ནས་རྒྱལ་པོ་འོད་བྱེད་དེས་དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་ལ་རིན་པོ་ཆེའི་མེ་ཏོག་ཐམས་ཅད་ཀྱིས་མངོན་པར་གཏོར་མངོན་པར་རབ་ཏུ་གཏོར་ཅིང་། དེའི་འོག་ཏུ་སྤོས་དང་མེ་ཏོག་དག་གིས་ཀྱང་གཏོར་ཏོ། །
en: “At that point King Radiant tossed and scattered every type of jewel flower toward the thus-gone Peaceful Action, and then incense and other flowers as well.

source: དེ་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་གྲངས་མེད་པ་བདུན་ཅུ་རྩ་དྲུག་ཏུ་ངན་འགྲོ་དང་ནམས་ཀྱང་དབུལ་བའི་རིགས་དང་། ནམས་ཀྱང་རིགས་དམའ་བར་མ་སྐྱེས་སོ། །
en: Due to those roots of virtue, for seventy-six immeasurable eons he was never born in the lower states, nor in classes of poverty or inferior classes.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འོད་བྱེད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “What do you think, Maudgalyāyana? In case you may think that at that time King Radiant was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འོད་བྱེད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: In those days I was King Radiant.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་དེ་ག་ལ་བར་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མེ་ཏོག་དང་། སྤོས་དང་། མེ་ཏོག་དག་གིས་མངོན་པར་གཏོར་ནས་ངས་གཞལ་དུ་མེད་པའི་གུས་པ་བྱས་སོ། །
en: I paid immeasurable respect by offering flowers of the seven precious substances, as well as incense and other flowers.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་གུས་པ་གཞལ་དུ་མེད་པ་བསྐྱེད་པར་བྱ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཀྱང་ཡོངས་སུ་མི་གཏང་བར་བྱ།
en: Therefore, Maudgalyāyana, when bodhisattvas are training in the practices of bodhisattvas, they should engender immeasurable respect to the blessed buddhas and never forsake the mind of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཡོངས་སུ་མ་བཏང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Bodhisattvas who never forsake the mind of omniscience will soon become irreversible from unsurpassed and perfect awakening.”

source: མཽད་གལ་གྱི་བུ་ངས་བསམ་གཏན་ཤེས་པར་བྱ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཇི་ལྟར་ཞི་གནས་ཀྱི་དབང་པོས་ངེས་པར་འབྱུང་བར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་རྒྱ་ཆེ་བ་རྣམ་པ་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva, I created numerous different roots of virtue in order to understand concentration. I wondered, ‘How can I fully awaken to unsurpassed and perfect awakening, and reach emancipation by means of the strength of tranquility?’ With that thought in mind, I created an immense amount of different roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་ཐམས་ཅད་སྐྱོབ་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Viśvabhū.

source: རྒྱལ་པོ་ཐམས་ཅད་སྐྱོབ་དེའི་བཙུན་མོ་བུད་མེད་དྲུག་ཁྲི་བརྒྱད་སྟོང་བྱུང་སྟེ་ལྷའི་བུ་མོའི་གཟུགས་དང་འདྲ་ཞིང་། མ་ལྟར་བྱམས་པ། སྲུ་མོ་ལྟར་ཡིད་གཅུགས་པ་བྲན་མོ་ལྟར་གུས་པ།
en: King Viśvabhū had sixty-eight thousand queens, all of whom had bodies like goddesses, were loving like mothers, caring like aunts, and respectful like servants.

source: ལྷ་མོ་ལྟར་ཡོན་ཏན་ཅན་དེ་དག་གི་ནང་ན་རྒྱལ་པོ་ཐམས་ཅད་སྐྱོབ་འདུག་སྟེའདོད་པ་ལས་དབེན་པ་སྡིག་པ་མི་དགེ་བའི་ཆོས་ལས་
en: Dwelling among such queens with qualities like goddesses, King Viśvabhū was nonetheless free of desire and free of anything negative and unvirtuous.

source: དབེན་པ་རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བའི་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: He was intelligent and discerning and had come to the culmination of the first level of concentration with its concomitant joy and bliss born of disengagement.

source: དེ་བཞིན་དུ་བསམ་གཏན་བཞི་པའི་བར་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །དེ་བསམ་གཏན་བཞི་པ་ལས་སྙོམས་པར་ཞུགས་ནས། བསམ་གཏན་བཞི་པ་ལས་ལངས་ཏེ།
en: Similarly, he reached the culmination of everything up to the fourth level of concentration, in which he abided. After dwelling in equanimity at the fourth level of concentration, he eventually emerged from it, and had the insight, ‘

source: སེམས་ཅན་དག་འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་མོས་ཤིང་འདོད་པ་ལ་ལྷག་པར་ཆགས།
en: Sentient beings pine after the five sense pleasures; they are totally attached to their desires.

source: སྡིག་པའི་ལས་དག་ཀུན་ཏུ་སྤྱོད་ཅིང་། སྡིག་པའི་ལས་དག་བྱས་པས་ངན་འགྲོར་རབ་ཏུ་ལྟུང་སྟེ།
en: They engage in and carry out harmful actions, due to which they fall into the lower states.

source: ཁ་ཅིག་ནི་སེམས་ཅན་དམྱལ་བར་ཁ་ཅིག་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ། ཁ་ཅིག་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ། ཁ་ཅིག་ནི་ལྷའི་འཇིག་རྟེན་དུ། ཁ་ཅིག་ནི་མིའི་འཇིག་རྟེན་དུ་ཚེ་ཐུང་ངུར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད།
en: Some of them create the karma for becoming hell beings, others for becoming animals, others for entering the realm of the Lord of Death, others the divine realms, and others the human realm but with short lives.

source: ཁ་ཅིག་ནི་ཚེ་རིང་པོར་འགྱུར། ཁ་ཅིག་ནི་གནོད་པ་ཉུང་བར་འགྱུར།
en: Some have a longer life, others face less harm.

source: ཁ་ཅིག་ནི་རིགས་དམའ་བར་འགྱུར། ཁ་ཅིག་ནི་རིགས་བཙུན་པར་འགྱུར།
en: Some end up in a low class while others end up in a noble class.

source: ཁ་ཅིག་ནི་གཟི་བརྗིད་ཆུང་བར་འགྱུར། ཁ་ཅིག་ནི་གཟི་བརྗིད་ཆེ་བར་འགྱུར།
en: Some have little charisma while others have more charisma.

source: ཁ་ཅིག་ནི་ལོངས་སྤྱོད་ཆུང་བར་འགྱུར། ཁ་ཅིག་ནི་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར།
en: Some have little wealth while others have more wealth.

source: ཁ་ཅིག་ནི་ཤེས་རབ་འཆལ་བར་འགྱུར། ཁ་ཅིག་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར།
en: Some are unintelligent while others are intelligent.

source: ཁ་ཅིག་ནི་རྒྱུན་གྱི་རྗེས་སུ་འབད། ཁ་ཅིག་ནི་རྒྱུན་ལས་བཟློག་པ་ལ་འབད་པ་དག་མཐོང་ངོ་། །
en: Some exert themselves in following the current, while others exert themselves in going against the current.’

source: ལམ་འདི་ནི་ཡུལ་དང་མི་འཐུན་པ་ཡིན་ཏེ།
en: ‘These paths are in disharmony with the goal.

source: གང་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ལམ་འདིར་བདག་གིས་སྐྱེ་བོ་འདི་དག་གཞུག་པར་བྱའོ་སྙམ་ནས།
en: I must guide these beings onto the path of the completely awakened ones.’

source: དེ་བསམ་གཏན་བཞི་པ་དེ་ལས་ལངས་ཏེ། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བསྐྱེད་དེ། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་རྣམས་སུ་རྒྱུ་ཞིང་སྤྱོད་དོ། །
en: “Emerging from the fourth level of concentration, he felt compassion for sentient beings and went wandering among and becoming involved with the various towns, cities, villages, and regions.

source: དེ་མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་ཐོབ་པའི་སྟོབས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོས་ནོན་པས་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་སྟོན་ཅིང་། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འགོག་པ་ན་གྲོང་ནས་གྲོང་དུ་གྲོང་ཁྱེར་ནས་གྲོང་ཁྱེར་དུ། ཡུལ་ནས་ཡུལ་དུ་སྤྱད་པ་སྤྱོད་དོ། །
en: Having achieved the five types of superknowledge, he was compelled by compassion and thus went from town to town, city to city, and region to region engaged in teaching the path of the ten virtuous actions and putting an end to the path of the ten unvirtuous actions.

source: དེའི་ཚེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ། །མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལས་བཟློག་གོ། །
en: He then led all those beings onto the path of the ten virtuous actions in that very buddha realm, and turned them away from the path of the ten unvirtuous actions.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །
en: He dedicated the path of the ten virtuous actions practiced by all those beings toward unsurpassed and perfect awakening.

source: དེ་ན་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དེ།
en: Then he led everyone in that buddha realm to the irreversible stage.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་པ་ལུས་ཞིག་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་ཚངས་པར་འགྱུར་ཞིང་ཚངས་པ་ཆེན་པོར་སྐྱེས་ནས་
en: Having guided all beings in that buddha realm to the irreversible stage, after dying, he became Brahmā in the Brahmā Realm where he was reborn into the state of Great Brahmā.

source: ཟིལ་གྱིས་གནོན་ཅིང་། ཟིལ་གྱིས་མི་ནོན་ཏོ། །
en: Once there, he was both subdued and not subdued.

source: དེ་ནས་ཤི་ནས་བསྐལ་པ་འཇིག་པའི་ཚེ་འོད་གསལ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ། །
en: Eventually, after dying there, at the termination of the eon he was born into the same state as the luminous gods.

source: འོད་གསལ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ནས་བསྐལ་པ་འཇིག་པའི་ཚེ་ཡང་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Born among the luminous gods, when the next eon ended, he was again reborn into the realm of Brahmā.

source: དེས་ཚངས་པའི་འཇིག་རྟེན་དེར་འདུག་པ་ན་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་བཙུད་དོ། །
en: There in the realm of Brahmā he led one quintillion beings to the level of non-regression.

source: ཡང་འཇིག་རྟེན་འཇིག་པ་ན་འོད་གསལ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ།
en: When that realm came to an end, he was again reborn among the luminous gods.

source: དེས་གནས་པ་དེར་སེམས་ཅན་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །དེ་ནམས་ཀྱང་དེར་སྐྱེས་པ་མེད་གང་ཆོས་མེད་པ་ལ་གནས་སོ། །
en: While he dwelled there, he led countless hundreds of billions of beings to the irreversible stage, such that they dwelled where there was no one ever born who was without the Dharma.

source: ཐབས་བརྒྱ་སྟོང་འདི་བྱས་པས་ཚངས་པའི་འཇིག་རྟེན་ནས་ཤི་ནས། འོད་གསལ་གྱི་ལྷའི་ནང་དུ་འོད་གསལ་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ།
en: Applying these hundreds of thousands of methods, after he died in the realm of Brahmā, he migrated among the luminous gods, and from there again to the realm of Brahmā.

source: གལ་ཏེ་བརྒྱ་ལ་མི་རྣམས་ཀྱི་ནང་དུ་འོངས་ཤིང་གང་གི་ཚེ་སངས་རྒྱས་མ་བྱུང་ན་ཡང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་འགྱུར།
en: When on occasion he would appear in the human realm, he would still possess the five types of superknowledge even though there was no buddha present.

source: སངས་རྒྱས་བྱུང་བ་བཞུགས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་རིམ་གྲོ་པར་གྱུར་ཏེ།
en: When there was a buddha present, he would serve as attendant to that blessed buddha.

source: དེ་དགེ་བའི་རྩ་བ་བསགས་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་སྙོམས་པར་འཇུག་པ་ལ་བཞུགས་པ་འདིས་བཞུགས་ཏེ།
en: Accumulating such roots of virtue, the blessed buddhas then led him to enter into equanimity, in which he then remained.

source: གལ་ཏེ་བདེ་བའམ། གལ་ཏེ་དབེན་པས་དེ་བཞིན་གཤེགས་པ་བཞུགས་སོ་ཞེས་ཤེས་སོ། །
en: Whether there was pleasure or whether there was disengagement, he knew the Thus-Gone One was present.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཐམས་ཅད་སྐྱོབ་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Viśvabhū was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཐམས་ཅད་སྐྱོབ་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was King Viśvabhū.

source: ངས་དེའི་ཚེ་དེའི་དུས་ན་ཡང་སྐྱེ་བོ་ཡུལ་ལ་ཆགས་པ་དག་བསམ་གཏན་ལ་བཀོད་ཅིང་། འདོད་པའི་ཁམས་ལས་ཐར་བར་བྱས་སོ། །
en: In those times I led to concentration beings who were attached to objects, and freed them from the desire realm.

source: ངས་ད་ཡང་སྐྱེ་བོ་ཡུལ་ལ་ཆགས་པ་དག་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཐར་བར་བྱ་ཞིང་། མྱ་ངན་ལས་འདས་པའི་ལམ་ལ་དགོད་པར་བྱའོ། །
en: Now, too, I will continue to liberate beings who are attached to objects from the suffering of cyclic existence and lead them onto the path of nirvāṇa.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་གྱི་དོན་བྱེད་པར་འདོད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, those bodhisattva great beings who want to benefit the world should train in the path to omniscience.

source: མཽད་གལ་གྱི་བུ་ངས་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡུལ་ལ་སྡུད་པར་གཞོལ་བའི་སེམས་ཅན་རྣམས་བདག་སློབ་པའི་རྗེས་སུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་ཇི་ལྟར་བསྟན་པར་བྱ་སྙམ་ནས
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of concentration. I wondered, ‘How can I train in order to teach the path of unsurpassed and perfect awakening to sentient beings who are determined to absorb themselves in objects?’ With that thought in mind,

source: དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I created numerous different roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ཞི་བའི་གནས་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named Tranquility ;

source: དེ་བཞིན་གཤེགས་པ་ཞི་བའི་གནས་དེའི་སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུར་གྱུར་ཏོ། །
en: The thus-gone Tranquility lived to be seventy quintillion years old.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བའི་གནས་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ནས་དགྲ་བཅོམ་པ་ནས་སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ཉན་ཐོས་ཁྲི་བྱུང་ངོ་། །
en: The first of the thus-gone Tranquility ’s gatherings of hearers numbered ten thousand. They were all worthy ones . . . who had obtained supreme perfection in mastering all mental states.

source: དེའི་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་དང་པོ་བརྒྱད་ཅུ་བྱུང་ངོ་། །
en: His first gathering of bodhisattvas numbered eighty.

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ནས་སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་གྱི་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་བྱུང་ངོ་། །
en: His second gathering of hearers numbered ninety quintillion. They were all worthy ones who had exhausted defilements . . . up to . . . who had obtained supreme perfection in mastering all mental states.

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ནི་དེའི་ཉིས་འགྱུར་བྱུང་སྟེ།
en: The second gathering of bodhisattvas was double that.

source: དེ་དག་ཐམས་ཅད་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དཔག་ཏུ་མེད་ཅིང་ཚད་མེད་པ་དང་ལྡན་པའི་བར་དུའོ། །
en: They all genuinely abided by the Great Vehicle . . . and possessed countless, innumerable utterly pure buddha realms

source: ཐབས་འདིས་དེ་བཞིན་གཤེགས་པ་དེའི་ཉན་ཐོས་འདུས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་དཔག་ཏུ་མེད་པ་བྱུང་ངོ་། །
en: In this manner, the Thus-Gone One’s gathering of hearers and bodhisattvas was limitless.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་གུས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “At the same time, in that Thus-Gone One’s buddha realm was a bodhisattva named Humble Tranquility.

source: དེ་བཞིན་གཤེགས་པ་དེའི་དེ་བཞིན་གཤེགས་པ་བཞུགས་པའི་རྗེས་སུ་འབྲང་བས་ཞི་གནས་ལ་གུས་པར་གྱུར་ཏོ། །
en: As he followed the living Thus-Gone One, he felt reverence for tranquility.

source: གཞན་ཡང་སྔོན་གྱི་རྒྱལ་བ་ལ་བསྙེན་བཀུར་བྱས་པས་འདྲ་བར་རྣམ་པར་མཐོང་བ་དང་ལྡན་པར་གྱུར་ཏེ།
en: Moreover, he had served victors in the past and so he had achieved a similar insight.

source: དེའི་ཞི་གནས་གང་རྣམ་པར་མཐོང་བ་ཐོབ་ནས། སྙིང་རྗེ་ཆེན་པོས་ནོན་པའི་སེམས་ཀྱིས་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་ནས།
en: Attaining insight into tranquility, he was overwhelmed by great compassion and thus he achieved knowledge of the origin as related to knowledge of concentration.

source: ཐབས་མཁས་པས་ཞི་གནས་ཀྱང་མི་མཐོང་ལ་རྣམ་པར་མཐོང་བ་ལ་ཡང་བསྟེན་ཏོ། །
en: Then, with his skill in methods, he was able to apply his tranquility to perceive the imperceptible.

source: དེས་རྫུ་འཕྲུལ་མངོན་ཏུ་བྱས་ནས་སྤྲུལ་པ་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: Manifesting miraculous powers , he could project thousands of emanations.

source: སྐྱེ་བོ་ཡུལ་གང་ལ་རྣམ་པར་གཡེངས་པ་དག་སྦྱིན་པས་བསྡུས་སོ། །
en: He attracted with generosity beings who were distracted by objects.

source: སྦྱིན་པས་བསྡུས་ནས་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་བཀོད་དོ། །
en: After attracting them with generosity, he led them to be more disciplined.

source: ཚུལ་ཁྲིམས་ལ་བཀོད་ནས་སངས་རྒྱས་ཀྱི་ཆོས་དག་རབ་ཏུ་བསྟན་ཏོ། །
en: Once they had become more disciplined, he taught them the buddhas’ teachings.

source: དེར་སེམས་ཅན་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་ཆོས་ཟབ་མོ་འདིའི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus, countless hundreds of billions of beings were led to have acceptance of the profound Dharma.

source: དམ་པའི་ཆོས་རྣམ་པར་ཤེས་པའི་ལུས་དང་སེམས་རྒྱས་པར་ཡང་དག་པར་རབ་ཏུ་འཛིན་པར་འགྱུར།
en: They came to possess bodies and minds that were fully developed in their discernment of the sublime Dharma.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་ཡང་རབ་ཏུ་བཙུད།
en: He led them to have great compassion.

source: སྔོན་བསམ་གཏན་དེ་དག་ལ་ཡང་རབ་ཏུ་བཙུད།
en: He had previously led them to be concentrated.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཡང་ཡུན་རིང་དུ་གོམས་པས་དེ་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་རབ་ཏུ་བཙུད་དེ།
en: Cultivating omniscient wisdom over an extended period, he was able to lead them toward the six perfections.

source: ཡུན་མི་རིང་བར་ཡོངས་སུ་དག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་ཞིང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་དོ། །
en: Before too long, he had fully awakened to unsurpassed and perfect awakening in a perfectly pure buddha realm, bringing with him countless quintillions of beings to nirvāṇa as he himself reached that state.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་གུས་པ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Humble Tranquility was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་གུས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Humble Tranquility.

source: དེས་ན་ང་བསམ་གཏན་གོམས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་སོ། །
en: As I then cultivated concentration, I came to fully master the six perfections.

source: གང་དུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཏུ་འགྱུར་ཏེ།
en: Whenever I applied the perfection of generosity, it became the six perfections;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅར་ཀུན་ཡོངས་སུ་རྫོགས་སོ། །
en: thus I mastered all of the six perfections.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སྤྱོད་ན་ཐབས་མཁས་ཤིང་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །
en: You should understand that if bodhisattvas practice in this way, they will gain skill in methods and non-regression.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་སེམས་ཅན་རྣམས་ལ་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། ཡུལ་གྱི་སྐྱོན་གང་ཐོས་ནས་སེམས་ཅན་རྣམས་ལ་སྟོན་པར་གྱུར་ཅིག་སྙམ་ནས་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུས་བྱས་སོ། །
en: “Furthermore, Maudgalyāyana, in order to understand the origin as related to knowledge of concentration, when I was training in the practices of a bodhisattva in the past, I thought, ‘May I become a teacher for beings, explaining to them correctly about knowledge of the origin as related to knowledge of concentration, that they may hear of the faults of objects. With that thought in mind, I created countless roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་པོ་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Maudgalyāyana, in the past there was a king named Enjoyer of Various Worlds.

source: རྒྱལ་པོ་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Once, King Enjoyer of Various Worlds had the thought,

source: ཇི་ལྟ་ཇི་ལྟར་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་དེ་ལྟ་དེ་ལྟར་ཡོན་ཏན་ལས་ཡོངས་སུ་ཉམས་པས་གང་བདག་གིས་ཡུལ་སྤངས་ཏེ་ཚལ་དུ་འགྲོའོ་སྙམ་མོ། །
en: ‘The more I amuse myself with the various worlds, the more my good qualities diminish. So I will renounce my kingdom and go to the forest.’

source: དེ་ནས་རྒྱལ་པོ་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་རྒྱལ་སྲིད་བོར་ནས་ཚལ་དུ་གནས་སོ། །
en: So King Enjoyer of Various Worlds gave up his kingdom and went off to live in the forest,

source: དེས་ཚལ་དུ་གནས་ནས་དབང་པོས་ཡུལ་རིག་ཅིང་ཞི་གནས་རིག་པས་རྣམ་པར་གནས་སོ། །
en: where he stayed, aware of objects with his senses and aware of tranquility.

source: བདག་གི་ཆོས་རྗེས་སུ་དྲན་པ་དང་ཡིད་ལ་བྱེད་པས་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བྱུང་བ་གང་ཡིན་སྙམ་མོ། །
en: ‘How did I produce knowledge of the origin as related to knowledge of concentration, by recollecting and bringing to mind the Dharma?’

source: བདག་གིས་བསམ་གཏན་ལ་ཞུགས་པ་རྣམས་ལ་སོ་སོར་དགྱེས་པ་བྱས་སོ། །
en: ‘It is because I have pleased those who are engaged in concentration.

source: དགེ་བའི་རྩ་བ་དེས་ང་བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་བོ། །
en: Due to those roots of virtue, I achieved knowledge of the origin as related to knowledge of concentration.

source: དགེ་བའི་རྩ་བ་དེ་རྗེས་སུ་དྲན་ནས་རིགས་ཀྱི་བུ་བསམ་གཏན་དང་རབ་ཏུ་ལྡན་པ་རྣམས་ལ་འཇིག་རྟེན་གྱི་ཟས་སོ་སོར་དགྱེས་པ་བྱས་སོ། །
en: Bringing those roots of virtue to mind, I pleased with worldly nourishment those noble children who dwell in states of concentration.’

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Enjoyer of Various Worlds was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འཇིག་རྟེན་སྣ་ཚོགས་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Enjoyer of Various Worlds.

source: ངས་སེམས་ཅན་ཞི་གནས་ལ་མངོན་པར་དགའ་བ་དེ་རྣམས་ལ་འཇིག་རྟེན་གྱི་ཟས་ཀྱིས་སྦྱིན་པ་བྱས་ཏེ། གང་ཞི་གནས་ལ་མངོན་པར་བརྩོན་པར་གནས་པ་རྣམས་ཀྱི་ཞི་གནས་བསྐྱེད་དོ། །
en: I gave worldly nourishment to beings who took pleasure in tranquility, by which those who strove for tranquility developed tranquility.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཞི་གནས་དང་འཐུན་པའི་བསམ་གཏན་པ་ལ་འཚོ་བའི་ཡོ་བྱད་རབ་ཏུ་སྦྱིན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, those bodhisattvas who want to fully awaken to unsurpassed and perfect buddhahood should give material support to those who practice concentration that is congruent with tranquility.

source: མཽད་གལ་གྱི་བུ་ངས་བསམ་གཏན་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of concentration.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཐོགས་མེད་དཔལ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Unhindered Glory.
